MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_fdcan.h
  * @brief   Header file for the FDCAN HAL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_FDCAN_H
#define STM32C5XX_HAL_FDCAN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"

/** @addtogroup STM32C5XX_HAL_Driver
  * @{
  */

#if defined(FDCAN1) || defined(FDCAN2)

/** @defgroup FDCAN FDCAN
  * @{
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup FDCAN_Exported_Constants HAL FDCAN Constants
  * @{
  */

#if defined(USE_HAL_FDCAN_GET_LAST_ERRORS) && (USE_HAL_FDCAN_GET_LAST_ERRORS == 1)
/** @defgroup FDCAN_Error_Codes FDCAN error codes
  * @{
  */

#define HAL_FDCAN_ERROR_NONE               (0UL)         /*!< No error                                                */
#define HAL_FDCAN_ERROR_LOG_OVERFLOW       FDCAN_IR_ELO  /*!< Overflow of CAN error logging counter                   */
#define HAL_FDCAN_ERROR_RAM_WDG            FDCAN_IR_WDI  /*!< Message RAM watchdog event occurred                     */
#define HAL_FDCAN_ERROR_PROTOCOL_ARBT      FDCAN_IR_PEA  /*!< Protocol error in arbitration phase (nominal bit time)  */
#define HAL_FDCAN_ERROR_PROTOCOL_DATA      FDCAN_IR_PED  /*!< Protocol error in data phase (data bit time)            */
#define HAL_FDCAN_ERROR_RESERVED_AREA      FDCAN_IR_ARA  /*!< Access to reserved address                              */
#define HAL_FDCAN_ERROR_TIMEOUT_OCCURRED   FDCAN_IR_TOO  /*!< Timeout occurred                                        */
#define HAL_FDCAN_ERROR_RAM_ACCESS_FAILURE FDCAN_IR_MRAF /*!< Message RAM access failure occurred                     */
#define HAL_FDCAN_ERROR_BUS_FAULT_OFF      FDCAN_IR_BO   /*!< Bus off error                                           */
#define HAL_FDCAN_ERROR_BUS_FAULT_PASSIVE  FDCAN_IR_EP   /*!< Error passive error                                     */
#define HAL_FDCAN_ERROR_BUS_FAULT_WARNING  FDCAN_IR_EW   /*!< Error warning error                                     */

/**
  * @}
  */
#endif /* USE_HAL_FDCAN_GET_LAST_ERRORS */

/** @defgroup FDCAN_Interrupt_Groups FDCAN interrupt groups
  * @{
  */

/**
  * @brief Rx FIFO 0 group.
  *        This group contains the following interrupts:
  *        - Rx FIFO 0 new message
  *        - Rx FIFO 0 full
  *        - Rx FIFO 0 message lost
  */
#define HAL_FDCAN_IT_GROUP_RX_FIFO_0      (FDCAN_ILS_RXFIFO0)

/**
  * @brief Rx FIFO 1 group.
  *        This group contains the following interrupts:
  *        - Rx FIFO 1 new message
  *        - Rx FIFO 1 full
  *        - Rx FIFO 1 message lost
  */
#define HAL_FDCAN_IT_GROUP_RX_FIFO_1      (FDCAN_ILS_RXFIFO1)

/**
  * @brief Status message group.
  *        This group contains the following interrupts:
  *        - Rx high priority message
  *        - Tx complete
  *        - Tx abort complete
  */
#define HAL_FDCAN_IT_GROUP_STATUS_MSG     (FDCAN_ILS_SMSG)

/**
  * @brief Tx FIFO error group.
  *        This group contains the following interrupts:
  *        - Tx FIFO empty
  *        - Tx event FIFO new data
  *        - Tx event FIFO full
  *        - Tx event FIFO element lost
  */
#define HAL_FDCAN_IT_GROUP_TX_FIFO_ERROR  (FDCAN_ILS_TFERR)

/**
  * @brief Miscellaneous group.
  *        This group contains the following interrupts:
  *        - Timestamp wraparound
  *        - Message RAM access failure
  *        - Timeout occurred
  */
#define HAL_FDCAN_IT_GROUP_MISC           (FDCAN_ILS_MISC)

/**
  * @brief Bit and line error group.
  *        This group contains the following interrupts:
  *        - Error logging overflow
  *        - Error passive
  */
#define HAL_FDCAN_IT_GROUP_BIT_LINE_ERROR (FDCAN_ILS_BERR)

/**
  * @brief Protocol error group.
  *        This group contains the following interrupts:
  *        - Error warning
  *        - Bus off
  *        - Message RAM watchdog
  *        - Protocol error in arbitration phase
  *        - Protocol error in data phase
  *        - Reserved address access error
  */
#define HAL_FDCAN_IT_GROUP_PROTOCOL_ERROR (FDCAN_ILS_PERR)

/**
  * @}
  */

/** @defgroup FDCAN_Interrupt_Sources FDCAN interrupt sources
  * @{
  */

/* FDCAN interrupt group Rx FIFO 0 */
#define HAL_FDCAN_IT_RX_FIFO_0_NEW_MSG        FDCAN_IE_RF0NE /*!< Rx FIFO 0 new message interrupt                     */
#define HAL_FDCAN_IT_RX_FIFO_0_FULL           FDCAN_IE_RF0FE /*!< Rx FIFO 0 full interrupt                            */
#define HAL_FDCAN_IT_RX_FIFO_0_MSG_LOST       FDCAN_IE_RF0LE /*!< Rx FIFO 0 message lost interrupt                    */

/* FDCAN interrupt group Rx FIFO 1 */
#define HAL_FDCAN_IT_RX_FIFO_1_NEW_MSG        FDCAN_IE_RF1NE /*!< Rx FIFO 1 new message interrupt                     */
#define HAL_FDCAN_IT_RX_FIFO_1_FULL           FDCAN_IE_RF1FE /*!< Rx FIFO 1 full interrupt                            */
#define HAL_FDCAN_IT_RX_FIFO_1_MSG_LOST       FDCAN_IE_RF1LE /*!< Rx FIFO 1 message lost interrupt                    */

/* FDCAN interrupt group Tx event FIFO */
#define HAL_FDCAN_IT_TX_FIFO_EMPTY           FDCAN_IE_TFEE  /*!< Tx FIFO empty                                        */
#define HAL_FDCAN_IT_TX_EVT_FIFO_NEW_DATA    FDCAN_IE_TEFNE /*!< Tx handler wrote Tx event FIFO element               */
#define HAL_FDCAN_IT_TX_EVT_FIFO_FULL        FDCAN_IE_TEFFE /*!< Tx event FIFO full                                   */
#define HAL_FDCAN_IT_TX_EVT_FIFO_ELEM_LOST   FDCAN_IE_TEFLE /*!< Tx event FIFO element lost                           */

