MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.h
/* FDCAN interrupt group status message */
#define HAL_FDCAN_IT_RX_HIGH_PRIORITY_MSG    FDCAN_IE_HPME  /*!< High priority message received                       */
#define HAL_FDCAN_IT_TX_COMPLETE             FDCAN_IE_TCE   /*!< Transmission completed                               */
#define HAL_FDCAN_IT_TX_ABORT_COMPLETE       FDCAN_IE_TCFE  /*!< Transmission cancellation finished                   */

/* FDCAN interrupt group misc. */
#define HAL_FDCAN_IT_TIMESTAMP_WRAPAROUND    FDCAN_IE_TSWE  /*!< Timestamp counter wrapped around                     */
#define HAL_FDCAN_IT_RAM_ACCESS_FAILURE      FDCAN_IE_MRAFE /*!< Message RAM access failure occurred                  */
#define HAL_FDCAN_IT_TIMEOUT_OCCURRED        FDCAN_IE_TOOE  /*!< Timeout reached                                      */

/* FDCAN interrupt group bit and line error */
#define HAL_FDCAN_IT_ERROR_LOGGING_OVERFLOW  FDCAN_IE_ELOE  /*!< Overflow of FDCAN error logging counter occurred     */
#define HAL_FDCAN_IT_ERROR_PASSIVE           FDCAN_IE_EPE   /*!< Error passive status changed                         */

/* FDCAN interrupt group protocol error */
#define HAL_FDCAN_IT_ERROR_WARNING           FDCAN_IE_EWE   /*!< Error warning status changed                         */
#define HAL_FDCAN_IT_BUS_OFF                 FDCAN_IE_BOE   /*!< Bus off status changed                               */
#define HAL_FDCAN_IT_RAM_WATCHDOG            FDCAN_IE_WDIE  /*!< Message RAM watchdog event due to missing READY      */
#define HAL_FDCAN_IT_ARB_PROTOCOL_ERROR      FDCAN_IE_PEAE  /*!< Protocol error in arbitration phase detected         */
#define HAL_FDCAN_IT_DATA_PROTOCOL_ERROR     FDCAN_IE_PEDE  /*!< Protocol error in data phase detected                */
#define HAL_FDCAN_IT_RESERVED_ADDRESS_ACCESS FDCAN_IE_ARAE  /*!< Access to reserved address occurred                  */

/**
  * @}
  */

/** @defgroup FDCAN_Interrupt_Flags FDCAN interrupt flags
  * @brief FDCAN interrupt register (FDCAN_IR): The flags are set when one of the listed conditions is detected.
  * @{
  */

/* FDCAN interrupt flags for Rx FIFO 0 */
#define HAL_FDCAN_FLAG_RX_FIFO_0_MSG_LOST     FDCAN_IR_RF0L /*!< Rx FIFO 0 message lost                               */
#define HAL_FDCAN_FLAG_RX_FIFO_0_FULL         FDCAN_IR_RF0F /*!< Rx FIFO 0 full                                       */
#define HAL_FDCAN_FLAG_RX_FIFO_0_NEW_MSG      FDCAN_IR_RF0N /*!< New message written to Rx FIFO 0                     */

/* FDCAN interrupt flags for Rx FIFO 1 */
#define HAL_FDCAN_FLAG_RX_FIFO_1_MSG_LOST      FDCAN_IR_RF1L /*!< Rx FIFO 1 message lost                              */
#define HAL_FDCAN_FLAG_RX_FIFO_1_FULL          FDCAN_IR_RF1F /*!< Rx FIFO 1 full                                      */
#define HAL_FDCAN_FLAG_RX_FIFO_1_NEW_MSG       FDCAN_IR_RF1N /*!< New message written to Rx FIFO 1                    */

/* FDCAN interrupt flags for Tx event FIFO */
#define HAL_FDCAN_FLAG_TX_EVT_FIFO_ELEM_LOST  FDCAN_IR_TEFL  /*!< Tx event FIFO element lost                          */
#define HAL_FDCAN_FLAG_TX_EVT_FIFO_FULL       FDCAN_IR_TEFF  /*!< Tx event FIFO full                                  */
#define HAL_FDCAN_FLAG_TX_EVT_FIFO_NEW_DATA   FDCAN_IR_TEFN  /*!< New Tx event FIFO element written                   */

/**
  * @}
  */

/** @defgroup FDCAN_IT_Tx_Complete_Buffers_Select FDCAN interrupt Tx complete buffers select
  * @{
  */

#define HAL_FDCAN_IT_TX_CPLT_BUFFER_0   (1UL << 0U)      /*!< Tx complete interrupt on Tx buffer 0     */
#define HAL_FDCAN_IT_TX_CPLT_BUFFER_1   (1UL << 1U)      /*!< Tx complete interrupt on Tx buffer 1     */
#define HAL_FDCAN_IT_TX_CPLT_BUFFER_2   (1UL << 2U)      /*!< Tx complete interrupt on Tx buffer 2     */
#define HAL_FDCAN_IT_TX_CPLT_BUFFER_ALL FDCAN_TXBTIE_TIE /*!< Tx complete interrupt on all Tx buffers  */

/**
  * @}
  */

/**  @defgroup FDCAN_IT_Tx_Abort_Buffers_Select FDCAN interrupt Tx abort buffer select
  * @{
  */

#define HAL_FDCAN_IT_TX_ABORT_BUFFER_0   (1UL << 0U)       /*!< Tx abort interrupt on Tx buffer 0     */
#define HAL_FDCAN_IT_TX_ABORT_BUFFER_1   (1UL << 1U)       /*!< Tx abort interrupt on Tx buffer 1     */
#define HAL_FDCAN_IT_TX_ABORT_BUFFER_2   (1UL << 2U)       /*!< Tx abort interrupt on Tx buffer 2     */
#define HAL_FDCAN_IT_TX_ABORT_BUFFER_ALL FDCAN_TXBCIE_CFIE /*!< Tx abort interrupt on all Tx buffers  */

/**
  * @}
  */

/** @defgroup FDCAN_Tx_Buffer_Location HAL FDCAN Tx location
  * @{
  */

#define HAL_FDCAN_TX_BUFFER_0   (1UL << 0U)    /*!< Tx buffer0     */
#define HAL_FDCAN_TX_BUFFER_1   (1UL << 1U)    /*!< Tx buffer1     */
#define HAL_FDCAN_TX_BUFFER_2   (1UL << 2U)    /*!< Tx buffer2     */
#define HAL_FDCAN_TX_BUFFER_ALL FDCAN_TXBAR_AR /*!< All Tx buffers */

/**
  * @}
  */

/** @defgroup FDCAN_Interrupt_Lines FDCAN interrupt lines
  * @{
  */

#define HAL_FDCAN_IT_LINE_0 FDCAN_ILE_EINT0 /*!< Interrupt line 0 */
#define HAL_FDCAN_IT_LINE_1 FDCAN_ILE_EINT1 /*!< Interrupt line 1 */

/**
  * @}
  */

/**
  * @}
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup FDCAN_Exported_Types HAL FDCAN Types
  * @{
  */

/**
  * @brief  HAL FDCAN frame type.
  * @note   When a Tx frame is configured as @ref HAL_FDCAN_FRAME_REMOTE, the FDCAN core always transmits a classic CAN
  *         remote frame @ref HAL_FDCAN_HEADER_FRAME_FORMAT_CAN according to ISO 11898-1, even if CAN FD operation is
  *         @ref HAL_FDCAN_FRAME_FORMAT_FD_NO_BRS or @ref HAL_FDCAN_FRAME_FORMAT_FD_BRS.
  *         There is no remote frame in CAN FD format by design.
  */
typedef enum
{
  HAL_FDCAN_FRAME_DATA   = 0U,  /*!< Data frame type   */
  HAL_FDCAN_FRAME_REMOTE = 1U   /*!< Remote frame type */
} hal_fdcan_frame_type_t;

/**
  * @brief  HAL FDCAN ID type.
  */
typedef enum
{
  HAL_FDCAN_ID_STANDARD = 0U, /*!< Standard ID type */
  HAL_FDCAN_ID_EXTENDED = 1U  /*!< Extended ID type */
} hal_fdcan_id_type_t;

/**
  * @brief  HAL FDCAN error state indicator.
  * @note   This field controls the ESI bit in the transmitted frame only for CAN FD data
  *         @ref HAL_FDCAN_HEADER_FRAME_FORMAT_FD_CAN.
  *         For classic CAN frames @ref HAL_FDCAN_HEADER_FRAME_FORMAT_CAN there is no ESI bit in the frame format;
  *         in that case the core ignores this field and behaves according to its own CAN error state machine.
  */
typedef enum
{
  HAL_FDCAN_ERROR_STATE_IND_ACTIVE  = 0U, /*!< Active error state indicator  */
  HAL_FDCAN_ERROR_STATE_IND_PASSIVE = 1U  /*!< Passive error state indicator */
} hal_fdcan_error_state_indicator_t;

/**
  * @brief  HAL FDCAN bitrate switching.
  * @note   Bit rate switch is only used for CAN FD data frames. For classic CAN @ref HAL_FDCAN_FRAME_FORMAT_CLASSIC_CAN
  *         or remote frames @ref HAL_FDCAN_FRAME_REMOTE, this field is ignored by the hardware.
  */
typedef enum
{
  HAL_FDCAN_BIT_RATE_SWITCH_OFF = 0U, /*!< Bit rate switching off */
  HAL_FDCAN_BIT_RATE_SWITCH_ON  = 1U  /*!< Bit rate switching on  */
} hal_fdcan_bit_rate_switch_t;

/**
  * @brief  HAL FDCAN header frame format.
  * @note   This field reflects the intended frame format, but the FDCAN core will override it to classic format
  *         to comply with the CAN/CAN FD protocol:
  *         - When a Tx frame is configured as @ref HAL_FDCAN_FRAME_REMOTE, the core always transmits a classic CAN
  *           remote frame, even if CAN FD operation is enabled i.e @ref HAL_FDCAN_FRAME_FORMAT_FD_NO_BRS or
  *           @ref HAL_FDCAN_FRAME_FORMAT_FD_BRS and this field is set to @ref HAL_FDCAN_HEADER_FRAME_FORMAT_FD_CAN.
  *         - When CAN FD operation is disabled @ref HAL_FDCAN_FRAME_FORMAT_CLASSIC_CAN, all frames are
  *           transmitted as classic CAN frames @ref HAL_FDCAN_HEADER_FRAME_FORMAT_CAN regardless of this field.
  */
typedef enum
{
  HAL_FDCAN_HEADER_FRAME_FORMAT_CAN    = 0U, /*!< Standard frame format                        */
  HAL_FDCAN_HEADER_FRAME_FORMAT_FD_CAN = 1U  /*!< CAN FD frame format (new DLC-coding and CRC) */
} hal_fdcan_header_frame_format_t;

/**
  * @brief  HAL FDCAN event FIFO.
  */
typedef enum
{
  HAL_FDCAN_TX_EVENTS_FIFO_DISCARD = 0U, /*!< Do not store Tx event in FIFO */
  HAL_FDCAN_TX_EVENTS_FIFO_STORE   = 1U  /*!< Store Tx event in FIFO        */
} hal_fdcan_tx_event_fifo_t;

/**
  * @brief  HAL FDCAN Tx event type.
  */
typedef enum
{
  HAL_FDCAN_TX_EVENT                   = 1U, /*!< A successful frame transmission                                     */
  HAL_FDCAN_TX_EVENT_IN_SPITE_OF_ABORT = 2U  /*!< Transmission in spite of cancellation. Both Corresponding Tx buffer
                                                  transmission occurred bit @ref FDCAN_IT_Tx_Complete_Buffers_Select
                                                  and cancellation finished bit @ref FDCAN_IT_Tx_Abort_Buffers_Select
                                                  are set.
                                                  This event type is set in case of:
                                                  - A successful frame transmission.
                                                  - A disabled auto-retransmission (DAR), that means:
                                                  @ref hal_fdcan_config_t::auto_retransmission equals to
                                                  @ref HAL_FDCAN_AUTO_RETRANSMISSION_DISABLE.
                                                  - Storage of Tx events is enabled, that means:
                                                  @ref hal_fdcan_tx_header_t::event_fifo_control equals to
                                                  @ref HAL_FDCAN_TX_EVENTS_FIFO_STORE.                                */
} hal_fdcan_tx_event_type_t;

/**
  * @brief  HAL FDCAN data length code.
  *         The definition is the following one:
  *          - For classic CAN:
  *            - 0 to 8 : received frame has 0 to 8 data bytes
  *            - 9 to 15: received frame has 8 data bytes (max)
  *          - For CAN FD:
  *            - 0 to 8 : received frame has 0 to 8 data bytes
  *            - 9 to 15: received frame has 12/16/20/24/32/48/64 data bytes
  * @note   For remote frames @ref HAL_FDCAN_FRAME_REMOTE, only the DLC encoded by this field is
  *         transmitted; no data bytes are sent and the contents of the Tx data buffer are ignored by the core.
  */
typedef enum
{
  HAL_FDCAN_DATA_LEN_CAN_FDCAN_0_BYTE = 0x0U, /*!< 0 byte data length code   */
  HAL_FDCAN_DATA_LEN_CAN_FDCAN_1_BYTE = 0x1U, /*!< 1 byte data length code   */
  HAL_FDCAN_DATA_LEN_CAN_FDCAN_2_BYTE = 0x2U, /*!< 2 bytes data length code  */
  HAL_FDCAN_DATA_LEN_CAN_FDCAN_3_BYTE = 0x3U, /*!< 3 bytes data length code  */
  HAL_FDCAN_DATA_LEN_CAN_FDCAN_4_BYTE = 0x4U, /*!< 4 bytes data length code  */
  HAL_FDCAN_DATA_LEN_CAN_FDCAN_5_BYTE = 0x5U, /*!< 5 bytes data length code  */
  HAL_FDCAN_DATA_LEN_CAN_FDCAN_6_BYTE = 0x6U, /*!< 6 bytes data length code  */
  HAL_FDCAN_DATA_LEN_CAN_FDCAN_7_BYTE = 0x7U, /*!< 7 bytes data length code  */
  HAL_FDCAN_DATA_LEN_CAN_FDCAN_8_BYTE = 0x8U, /*!< 8 bytes data length code  */
  HAL_FDCAN_DATA_LEN_FDCAN_12_BYTE    = 0x9U, /*!< 12 bytes data length code */
  HAL_FDCAN_DATA_LEN_FDCAN_16_BYTE    = 0xAU, /*!< 16 bytes data length code */
  HAL_FDCAN_DATA_LEN_FDCAN_20_BYTE    = 0xBU, /*!< 20 bytes data length code */
  HAL_FDCAN_DATA_LEN_FDCAN_24_BYTE    = 0xCU, /*!< 24 bytes data length code */
  HAL_FDCAN_DATA_LEN_FDCAN_32_BYTE    = 0xDU, /*!< 32 bytes data length code */
  HAL_FDCAN_DATA_LEN_FDCAN_48_BYTE    = 0xEU, /*!< 48 bytes data length code */
  HAL_FDCAN_DATA_LEN_FDCAN_64_BYTE    = 0xFU  /*!< 64 bytes data length code */
} hal_fdcan_data_length_code_t;

/**
  * @brief  HAL FDCAN frame format.
  */
typedef enum
{
  HAL_FDCAN_FRAME_FORMAT_CLASSIC_CAN = 0U,                                  /*!< Classic mode                      */
  HAL_FDCAN_FRAME_FORMAT_FD_NO_BRS   = FDCAN_CCCR_FDOE,                     /*!< FD mode without bitrate switching */
  HAL_FDCAN_FRAME_FORMAT_FD_BRS      = (FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE), /*!< FD mode with bitrate switching    */
} hal_fdcan_frame_format_t;

/**
  * @brief  HAL FDCAN timestamp selection.
  */
typedef enum
{
  HAL_FDCAN_TIMESTAMP_SOURCE_ZERO     = 0U,                            /*!< Timestamp counter disabled (value is 0) */
  HAL_FDCAN_TIMESTAMP_SOURCE_INTERNAL = (0x1UL << FDCAN_TSCC_TSS_Pos), /*!< Internal timestamp counter              */
  HAL_FDCAN_TIMESTAMP_SOURCE_EXTERNAL = (0x2UL << FDCAN_TSCC_TSS_Pos), /*!< External timestamp counter              */
} hal_fdcan_timestamp_source_t;

/**
  * @brief  HAL FDCAN high priority filter list definition.
  */
typedef enum
{
  HAL_FDCAN_HIGH_PRIO_FILTER_STANDARD = 0U,             /*!< Standard filter list */
  HAL_FDCAN_HIGH_PRIO_FILTER_EXTENDED = FDCAN_HPMS_FLST /*!< Extended filter list */
} hal_fdcan_high_prio_filter_list_t;

/**
  * @brief  HAL FDCAN receive error passive level definition.
  */
typedef enum
{
  HAL_FDCAN_RX_ERROR_PASSIVE_BELOW_LEVEL = 0U,           /*!< The receive error counter is below
                                                              the error passive level of 128 */
  HAL_FDCAN_RX_ERROR_PASSIVE_REACH_LEVEL = FDCAN_ECR_RP, /*!< The receive error counter has reached
                                                              the error passive level of 128 */
} hal_fdcan_rx_error_passive_level_t;

/**
  * @brief  HAL FDCAN state structures definition.
  */
typedef enum
{
  HAL_FDCAN_STATE_RESET      = 0U,           /*!< Not yet initialized                               */
  HAL_FDCAN_STATE_INIT       = (1UL << 31U), /*!< Initialized but not yet configured                */
  HAL_FDCAN_STATE_IDLE       = (1UL << 30U), /*!< Initialized and a global config applied           */
  HAL_FDCAN_STATE_ACTIVE     = (1UL << 29U), /*!< The peripheral is running                         */
  HAL_FDCAN_STATE_POWER_DOWN = (1UL << 28U), /*!< The peripheral is in power down mode (sleep mode) */
} hal_fdcan_state_t;

/**
  * @brief  HAL FDCAN mode enumeration definition.
  */
typedef enum
{
  HAL_FDCAN_MODE_NORMAL               = 0U,                               /*!< Normal mode               */
  HAL_FDCAN_MODE_RESTRICTED_OPERATION = FDCAN_CCCR_ASM,                   /*!< Restricted operation mode */
  HAL_FDCAN_MODE_BUS_MONITORING       = FDCAN_CCCR_MON,                   /*!< Bus monitoring mode       */
  HAL_FDCAN_MODE_EXTERNAL_LOOPBACK    = FDCAN_CCCR_TEST,                  /*!< External loopback mode    */
  HAL_FDCAN_MODE_INTERNAL_LOOPBACK    = FDCAN_CCCR_TEST | FDCAN_CCCR_MON, /*!< Internal loopback mode    */
  HAL_FDCAN_MODE_INVALID              = FDCAN_CCCR_ASM | FDCAN_CCCR_MON
                                        | FDCAN_CCCR_TEST                 /*!< FDCAN invalid mode        */
} hal_fdcan_mode_t;

/**
  * @brief  HAL FDCAN FIFO operation mode.
  */
typedef enum
{
  HAL_FDCAN_RX_FIFO_MODE_BLOCKING  = 0U, /*!< Rx FIFO blocking mode  */
  HAL_FDCAN_RX_FIFO_MODE_OVERWRITE = 1U, /*!< Rx FIFO overwrite mode */
} hal_fdcan_rx_fifo_mode_t;

/**
  * @brief  HAL FDCAN auto retransmission setting.
  */
typedef enum
{
  HAL_FDCAN_AUTO_RETRANSMISSION_ENABLE  = 0U,             /*!< Enable transmitter auto retransmission */
  HAL_FDCAN_AUTO_RETRANSMISSION_DISABLE = FDCAN_CCCR_DAR, /*!< Disable transmitter auto retransmission */
} hal_fdcan_auto_retransmission_state_t;

/**
  * @brief  HAL FDCAN transmit pause setting.
  */
typedef enum
{
  HAL_FDCAN_TRANSMIT_PAUSE_DISABLE = 0U,             /*!< Disable transmitter transmit pause  */
  HAL_FDCAN_TRANSMIT_PAUSE_ENABLE  = FDCAN_CCCR_TXP, /*!< Enable transmitter transmit pause */
} hal_fdcan_transmit_pause_state_t;

/**
  * @brief  HAL FDCAN protocol exception setting.
  */
typedef enum
{
  HAL_FDCAN_PROTOCOL_EXCEPTION_ENABLE  = 0U,              /*!< Enable transmitter protocol exception  */
  HAL_FDCAN_PROTOCOL_EXCEPTION_DISABLE = FDCAN_CCCR_PXHD, /*!< Disable transmitter protocol exception */
} hal_fdcan_protocol_exception_state_t;

/**
  * @brief  HAL FDCAN transmitter delay Compensation status.
  */
typedef enum
{
  HAL_FDCAN_TX_DLY_COMPENSATION_DISABLED = 0U,             /*!< Transmitter delay compensation disabled */
  HAL_FDCAN_TX_DLY_COMPENSATION_ENABLED  = FDCAN_DBTP_TDC, /*!< Transmitter delay compensation enabled  */
} hal_fdcan_tx_delay_comp_status_t;

/**
  * @brief  HAL FDCAN ISO mode status.
  */
typedef enum
{
  HAL_FDCAN_ISO_MODE_ENABLED  = 0U,              /*!< Protocol configured for ISO mode         */
  HAL_FDCAN_ISO_MODE_DISABLED = FDCAN_CCCR_NISO, /*!< Protocol configured for CAN FD v2.0 mode */
} hal_fdcan_iso_mode_status_t;

/**
  * @brief  HAL FDCAN Tx buffer pending status.
  */
typedef enum
{
  HAL_FDCAN_TX_BUFFER_NOT_PENDING = 0U, /*!< No buffer pending           */
  HAL_FDCAN_TX_BUFFER_PENDING     = 1U, /*!< At least one buffer pending */
} hal_fdcan_tx_buffer_status_t;

/**
  * @brief  HAL FDCAN received frame status.
  */
typedef enum
{
  HAL_FDCAN_RX_FRAME_MATCHED     = 0U, /*!< Received frame matches filter index FIDx           */
  HAL_FDCAN_RX_FRAME_NOT_MATCHED = 1U  /*!< Received frame did not match any Rx filter element */
} hal_fdcan_rx_frame_status_t;

/**
  * @brief  HAL FDCAN restricted operation mode status.
  */
typedef enum
{
  HAL_FDCAN_RESTRICTED_OP_MODE_DISABLED = 0U,            /*!< Restricted mode disabled */
  HAL_FDCAN_RESTRICTED_OP_MODE_ENABLED  = FDCAN_CCCR_ASM /*!< Restricted mode enabled  */
} hal_fdcan_restricted_op_mode_status_t;

/**
  * @brief  HAL FDCAN edge filtering status.
  */
typedef enum
{
  HAL_FDCAN_EDGE_FILTERING_DISABLED = 0U,              /*!< Edge filtering disabled */
  HAL_FDCAN_EDGE_FILTERING_ENABLED  = FDCAN_CCCR_EFBI, /*!< Edge filtering enabled  */
} hal_fdcan_edge_filtering_status_t;

/**
  * @brief  HAL FDCAN FIFO/queue status - free or full.
  */
typedef enum
{
  HAL_FDCAN_FIFO_STATUS_FREE = 0U,               /*!< Tx FIFO/Queue not full */
  HAL_FDCAN_FIFO_STATUS_FULL = FDCAN_TXFQS_TFQF, /*!< Tx FIFO/Queue full     */
} hal_fdcan_fifo_status_t;

/**
  * @brief  HAL FDCAN timeout counter status.
  */
typedef enum
{
  HAL_FDCAN_TIMEOUT_COUNTER_DISABLED = 0U,             /*!< Timeout counter disabled */
  HAL_FDCAN_TIMEOUT_COUNTER_ENABLED  = FDCAN_TOCC_ETOC /*!< Timeout counter enabled  */
} hal_fdcan_timeout_counter_status_t;

/**
  * @brief  HAL FDCAN interrupts status.
  */
typedef enum
{
  HAL_FDCAN_IT_DISABLED = 0U, /*!< Interrupt disabled */
  HAL_FDCAN_IT_ENABLED  = 1U, /*!< Interrupt enabled  */
} hal_fdcan_it_status_t;

/**
  * @brief  HAL FDCAN interrupt lines status.
  */
typedef enum
{
  HAL_FDCAN_IT_LINE_DISABLED = 0U, /*!< Interrupt line disabled */
  HAL_FDCAN_IT_LINE_ENABLED  = 1U, /*!< Interrupt line enabled  */
} hal_fdcan_it_lines_status_t;

/**
  * @brief  HAL FDCAN Tx buffer transmission complete interrupt status.
  */
typedef enum
{
  HAL_FDCAN_IT_TX_BUFFER_CPLT_DISABLED = 0U, /*!< Tx buffer transmission complete interrupt disabled */
  HAL_FDCAN_IT_TX_BUFFER_CPLT_ENABLED  = 1U, /*!< Tx buffer transmission complete interrupt enabled  */
} hal_fdcan_it_tx_buffer_complete_status_t;

/**
  * @brief  HAL FDCAN Tx buffer abort finished interrupt status.
  */
typedef enum
{
  HAL_FDCAN_IT_TX_BUFFER_ABORT_DISABLED  = 0U, /*!< Tx buffer abort finished interrupt disabled */
  HAL_FDCAN_IT_TX_BUFFER_ABORT_ENABLED   = 1U, /*!< Tx buffer abort finished interrupt enabled  */
} hal_fdcan_it_tx_buffer_abort_status_t;

/**
  * @brief  HAL FDCAN warning status.
  */
typedef enum
{
  HAL_FDCAN_WARNING_ERROR_ALL_COUNTERS_UNDER_LIMIT = 0U,          /*!< Both error counters are below
                                                                       the error_warning of 96       */
  HAL_FDCAN_WARNING_ERROR_ANY_COUNTER_OVER_LIMIT   = FDCAN_PSR_EW /*!< At least one of the error counter has reached
                                                                       the error_warning limit of 96 */
} hal_fdcan_warning_status_t;

/**
  * @brief  HAL FDCAN bus_off status.
  */
typedef enum
{
  HAL_FDCAN_BUS_OFF_FLAG_RESET = 0U,          /*!< The FDCAN is not in bus_off state */
  HAL_FDCAN_BUS_OFF_FLAG_SET   = FDCAN_PSR_BO /*!< The FDCAN is in bus_off state     */
} hal_fdcan_bus_off_status_t;

/**
  * @brief  HAL FDCAN  ESI (Error Status Indicator) flag of last received FDCAN message.
  */
typedef enum
{
  HAL_FDCAN_ESI_FLAG_RESET = 0U,            /*!< Last received FDCAN message did not have its ESI flag set */
  HAL_FDCAN_ESI_FLAG_SET   = FDCAN_PSR_RESI /*!< Last received FDCAN message has its ESI flag set          */
} hal_fdcan_esi_flag_status_t;

/**
  * @brief  HAL FDCAN BSR (Bit Rate Switch) flag of last received FDCAN message.
  */
typedef enum
{
  HAL_FDCAN_BRS_FLAG_RESET = 0U,             /*!< Last received FDCAN message did not have its BRS flag set */
  HAL_FDCAN_BRS_FLAG_SET   = FDCAN_PSR_RBRS, /*!< Last received FDCAN message has its BRS flag set          */
} hal_fdcan_brs_flag_status_t;

/**
  * @brief  HAL FDCAN received EDL (Extended Data length) message.
  */
typedef enum
{
  HAL_FDCAN_EDL_FLAG_RESET = 0U,            /*!< No FDCAN message has been received since this bit was reset by CPU */
  HAL_FDCAN_EDL_FLAG_SET   = FDCAN_PSR_REDL /*!< Message in FDCAN format with EDL flag                              */
} hal_fdcan_edl_flag_status_t;

/**
  * @brief  HAL FDCAN error status definition.
  */
typedef enum
{
  HAL_FDCAN_ERROR_ACTIVE  = 0U,          /*!< Error active state  */
  HAL_FDCAN_ERROR_PASSIVE = FDCAN_PSR_EP /*!< Error passive state */
} hal_fdcan_protocol_error_status_t;

/**
  * @brief  HAL FDCAN filter type, defines the filtering method used for FDCAN standard and extended filters.
  * The case @ref HAL_FDCAN_FILTER_TYPE_RANGE_NO_EIDM must be processed differently depending
  * on standard or extended filter.
  */
typedef enum
{
  HAL_FDCAN_FILTER_TYPE_RANGE         = 0U,           /*!< Range filter from FilterID1 to FilterID2             */
  HAL_FDCAN_FILTER_TYPE_DUAL          = (1UL << 30U), /*!< Dual ID filter for FilterID1 or FilterID2            */
  HAL_FDCAN_FILTER_TYPE_CLASSIC       = (2UL << 30U), /*!< Classic filter: FilterID1 = filter, FilterID2 = mask */
  HAL_FDCAN_FILTER_TYPE_RANGE_NO_EIDM = (3UL << 30U)  /*!< Range filter from FilterID1 to FilterID2,
                                                           EIDM mask not applied                                */
} hal_fdcan_filter_type_t;

/**
  * @brief  HAL FDCAN kernel clock divider.
  */
typedef enum
{
  HAL_FDCAN_CLOCK_DIV_1  = 0UL,  /*!< Divide kernel clock by 1  */
  HAL_FDCAN_CLOCK_DIV_2  = 1UL,  /*!< Divide kernel clock by 2  */
  HAL_FDCAN_CLOCK_DIV_4  = 2UL,  /*!< Divide kernel clock by 4  */
  HAL_FDCAN_CLOCK_DIV_6  = 3UL,  /*!< Divide kernel clock by 6  */
  HAL_FDCAN_CLOCK_DIV_8  = 4UL,  /*!< Divide kernel clock by 8  */
  HAL_FDCAN_CLOCK_DIV_10 = 5UL,  /*!< Divide kernel clock by 10 */
  HAL_FDCAN_CLOCK_DIV_12 = 6UL,  /*!< Divide kernel clock by 12 */
  HAL_FDCAN_CLOCK_DIV_14 = 7UL,  /*!< Divide kernel clock by 14 */
  HAL_FDCAN_CLOCK_DIV_16 = 8UL,  /*!< Divide kernel clock by 16 */
  HAL_FDCAN_CLOCK_DIV_18 = 9UL,  /*!< Divide kernel clock by 18 */
  HAL_FDCAN_CLOCK_DIV_20 = 10UL, /*!< Divide kernel clock by 20 */
  HAL_FDCAN_CLOCK_DIV_22 = 11UL, /*!< Divide kernel clock by 22 */
  HAL_FDCAN_CLOCK_DIV_24 = 12UL, /*!< Divide kernel clock by 24 */
  HAL_FDCAN_CLOCK_DIV_26 = 13UL, /*!< Divide kernel clock by 26 */
  HAL_FDCAN_CLOCK_DIV_28 = 14UL, /*!< Divide kernel clock by 28 */
  HAL_FDCAN_CLOCK_DIV_30 = 15UL, /*!< Divide kernel clock by 30 */
} hal_fdcan_clock_divider_t;

/**
  * @brief  HAL FDCAN Tx FIFO/queue mode.
  */
typedef enum
{
  HAL_FDCAN_TX_MODE_FIFO  = 0U,              /*!< Tx FIFO mode  */
  HAL_FDCAN_TX_MODE_QUEUE = FDCAN_TXBC_TFQM, /*!< Tx queue mode */
} hal_fdcan_tx_mode_t;

