MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.h
/**
  * @brief  HAL FDCAN high priority storage.
  */
typedef enum
{
  HAL_FDCAN_HP_MSG_FIFO_NONE = 0U,                            /*!< No FIFO selected         */
  HAL_FDCAN_HP_MSG_FIFO_LOST = (0x1UL << FDCAN_HPMS_MSI_Pos), /*!< FIFO message lost        */
  HAL_FDCAN_HP_MSG_RX_FIFO_0 = (0x2UL << FDCAN_HPMS_MSI_Pos), /*!< Message stored in FIFO 0 */
  HAL_FDCAN_HP_MSG_RX_FIFO_1 = FDCAN_HPMS_MSI,                /*!< Message stored in FIFO 1 */
} hal_fdcan_high_prio_message_storage_t;

/**
  * @brief  HAL FDCAN protocol exception event.
  */
typedef enum
{
  HAL_FDCAN_PROTOCOL_NO_EVENT_OCCURRED = 0U,           /*!< No protocol event occurred since last read access */
  HAL_FDCAN_PROTOCOL_EVENT_OCCURRED    = FDCAN_PSR_PXE /*!< Protocol event occurred                           */
} hal_fdcan_protocol_exception_event_t;

/**
  * @brief  HAL FDCAN filter Configuration.
  */
typedef enum
{
  HAL_FDCAN_FILTER_DISABLE         = 0U, /*!< Disable filter element                                          */
  HAL_FDCAN_FILTER_TO_RX_FIFO_0    = 1U, /*!< Store in Rx FIFO 0 if filter matches                            */
  HAL_FDCAN_FILTER_TO_RX_FIFO_1    = 2U, /*!< Store in Rx FIFO 1 if filter matches                            */
  HAL_FDCAN_FILTER_REJECT          = 3U, /*!< Reject ID if filter matches                                     */
  HAL_FDCAN_FILTER_HP              = 4U, /*!< Set high priority if filter matches                             */
  HAL_FDCAN_FILTER_TO_RX_FIFO_0_HP = 5U, /*!< Set high priority and store in FIFO 0 if filter matches         */
  HAL_FDCAN_FILTER_TO_RX_FIFO_1_HP = 6U, /*!< Set high priority and store in FIFO 1 if filter matches         */
} hal_fdcan_filter_config_t;

/**
  * @brief  HAL FDCAN Rx location.
  */
typedef enum
{
  HAL_FDCAN_RX_FIFO_0    = 0U, /*!< Index for access to Rx FIFO 0    */
  HAL_FDCAN_RX_FIFO_1    = 1U, /*!< Index for access to Rx FIFO 1    */
} hal_fdcan_rx_location_t;

/**
  * @brief  HAL FDCAN protocol error code.
  */
typedef enum
{
  HAL_FDCAN_PROTOCOL_ERROR_NONE      = 0U, /*!< No error occurred         */
  HAL_FDCAN_PROTOCOL_ERROR_STUFF     = 1U, /*!< Stuff error               */
  HAL_FDCAN_PROTOCOL_ERROR_FORM      = 2U, /*!< Form error                */
  HAL_FDCAN_PROTOCOL_ERROR_ACK       = 3U, /*!< Acknowledge error         */
  HAL_FDCAN_PROTOCOL_ERROR_BIT1      = 4U, /*!< Bit 1 (recessive) error   */
  HAL_FDCAN_PROTOCOL_ERROR_BIT0      = 5U, /*!< Bit 0 (dominant) error    */
  HAL_FDCAN_PROTOCOL_ERROR_CRC       = 6U, /*!< CRC check sum error       */
  HAL_FDCAN_PROTOCOL_ERROR_NO_CHANGE = 7U, /*!< No change since last read */
} hal_fdcan_protocol_error_code_t;

/**
  * @brief  HAL FDCAN communication state.
  */
typedef enum
{
  HAL_FDCAN_COM_STATE_SYNC = 0U,                           /*!< Node is synchronizing on CAN communication */
  HAL_FDCAN_COM_STATE_IDLE = (0x1UL << FDCAN_PSR_ACT_Pos), /*!< Node is neither receiver nor transmitter   */
  HAL_FDCAN_COM_STATE_RX   = (0x2UL << FDCAN_PSR_ACT_Pos), /*!< Node is operating as receiver              */
  HAL_FDCAN_COM_STATE_TX   = FDCAN_PSR_ACT,                /*!< Node is operating as transmitter           */
} hal_fdcan_communication_state_t;

/**
  * @brief  HAL FDCAN non-matching frames acceptance rules.
  */
typedef enum
{
  HAL_FDCAN_NO_MATCH_TO_RX_FIFO_0 = 0U, /*!< Accept non-matching frames to Rx FIFO0 */
  HAL_FDCAN_NO_MATCH_TO_RX_FIFO_1 = 1U, /*!< Accept non-matching frames to Rx FIFO1 */
  HAL_FDCAN_NO_MATCH_REJECT       = 2U, /*!< Reject non-matching frames             */
} hal_fdcan_non_matching_acceptance_rules_t;

/**
  * @brief  HAL FDCAN remote frames acceptance rules.
  */
typedef enum
{
  HAL_FDCAN_REMOTE_ACCEPT = 0U, /*!< Accept remote frames     */
  HAL_FDCAN_REMOTE_REJECT = 1U, /*!< Reject all remote frames */
} hal_fdcan_remote_acceptance_frame_t;

/**
  * @brief  HAL FDCAN timestamp prescaler.
  */
typedef enum
{
  HAL_FDCAN_TIMESTAMP_PRESC_1  = 0U,                            /*!< Timestamp counter time unit is x1 CAN bit time   */
  HAL_FDCAN_TIMESTAMP_PRESC_2  = (0x1UL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x2 CAN bit time   */
  HAL_FDCAN_TIMESTAMP_PRESC_3  = (0x2UL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x3 CAN bit time   */
  HAL_FDCAN_TIMESTAMP_PRESC_4  = (0x3UL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x4 CAN bit time   */
  HAL_FDCAN_TIMESTAMP_PRESC_5  = (0x4UL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x5 CAN bit time   */
  HAL_FDCAN_TIMESTAMP_PRESC_6  = (0x5UL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x6 CAN bit time   */
  HAL_FDCAN_TIMESTAMP_PRESC_7  = (0x6UL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x7 CAN bit time   */
  HAL_FDCAN_TIMESTAMP_PRESC_8  = (0x7UL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x8 CAN bit time   */
  HAL_FDCAN_TIMESTAMP_PRESC_9  = (0x8UL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x9 CAN bit time   */
  HAL_FDCAN_TIMESTAMP_PRESC_10 = (0x9UL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x10 CAN bit time  */
  HAL_FDCAN_TIMESTAMP_PRESC_11 = (0xAUL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x11 CAN bit time  */
  HAL_FDCAN_TIMESTAMP_PRESC_12 = (0xBUL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x12 CAN bit time  */
  HAL_FDCAN_TIMESTAMP_PRESC_13 = (0xCUL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x13 CAN bit time  */
  HAL_FDCAN_TIMESTAMP_PRESC_14 = (0xDUL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x14 CAN bit time  */
  HAL_FDCAN_TIMESTAMP_PRESC_15 = (0xEUL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x15 CAN bit time  */
  HAL_FDCAN_TIMESTAMP_PRESC_16 = (0xFUL << FDCAN_TSCC_TCP_Pos), /*!< Timestamp counter time unit is x16 CAN bit time  */
} hal_fdcan_timestamp_prescaler_t;

/**
  * @brief  HAL FDCAN Tx FIFO free level.
  */
typedef enum
{
  HAL_FDCAN_TX_FIFO_FREE_LEVEL_0  = 0U,  /*!< Tx FIFO Full - no free FIFO slot        */
  HAL_FDCAN_TX_FIFO_FREE_LEVEL_1  = 1U,  /*!< 1 free FIFO slot available in Tx FIFO   */
  HAL_FDCAN_TX_FIFO_FREE_LEVEL_2  = 2U,  /*!< 2 free FIFO slots available in Tx FIFO  */
  HAL_FDCAN_TX_FIFO_FREE_LEVEL_3  = 3U,  /*!< 3 free FIFO slots available in Tx FIFO  */
} hal_fdcan_tx_fifo_free_level_t;

/**
  * @brief  HAL FDCAN timeout operation.
  */
typedef enum
{
  HAL_FDCAN_TIMEOUT_CONTINUOUS     = 0U,                          /*!< Timeout continuous operation        */
  HAL_FDCAN_TIMEOUT_TX_EVENT_FIFO  = (1UL << FDCAN_TOCC_TOS_Pos), /*!< Timeout controlled by Tx event FIFO */
  HAL_FDCAN_TIMEOUT_RX_FIFO_0      = (2UL << FDCAN_TOCC_TOS_Pos), /*!< Timeout controlled by Rx FIFO 0     */
  HAL_FDCAN_TIMEOUT_RX_FIFO_1      = (3UL << FDCAN_TOCC_TOS_Pos), /*!< Timeout controlled by Rx FIFO 1     */
} hal_fdcan_timeout_operation_t;

/**
  * @brief  HAL FDCAN instance definition.
  */
typedef enum
{
  HAL_FDCAN1 = FDCAN1_BASE, /*!< Peripheral instance FDCAN1 */
#if defined(FDCAN2)
  HAL_FDCAN2 = FDCAN2_BASE, /*!< Peripheral instance FDCAN2 */
#endif /* FDCAN2 */
} hal_fdcan_t;

/**
  * @brief  HAL FDCAN Rx element header definition.
  */
typedef union
{
  uint64_t                            d64;                        /*!< 64-bit FDCAN Rx element header                 */
  struct
  {
    uint32_t                          identifier            : 29; /*!< Received identifier. A standard identifier
                                                                       is stored in bits [28:18]                      */
    hal_fdcan_frame_type_t            frame_type            : 1;  /*!< Frame type                                     */
    hal_fdcan_id_type_t               identifier_type       : 1;  /*!< Received identifier type                       */
    hal_fdcan_error_state_indicator_t error_state_indicator : 1;  /*!< Error state indicator                          */
    uint32_t                          rx_timestamp          : 16; /*!< Rx timestamp. Timestamp counter value is
                                                                       captured at the start of frame reception.
                                                                       Resolution depends on the timestamp counter
                                                                       prescaler                                      */
    hal_fdcan_data_length_code_t      data_length           : 4;  /*!< Received frame data length code                */
    hal_fdcan_bit_rate_switch_t       bit_rate_switch       : 1;  /*!< Bit rate switch indicator                      */
    hal_fdcan_header_frame_format_t   frame_format          : 1;  /*!< Received frame format                          */
    uint32_t                                                : 2;  /*!< Rx reserved                                    */
    uint32_t                          filter_index          : 7;  /*!< Filter index.
                                                                       - 0-127: index of matching Rx acceptance
                                                                       filter element, invalid if the received frame
                                                                       did not match any Rx filter element:
                                                                       @ref hal_fdcan_rx_header_t::frame_status
                                                                       is @ref HAL_FDCAN_RX_FRAME_NOT_MATCHED
                                                                       - Range is:
                                                                       0 to @ref hal_fdcan_config_t::std_filters_nbr or
                                                                       0 to @ref hal_fdcan_config_t::ext_filters_nbr  */
    hal_fdcan_rx_frame_status_t       frame_status          : 1;  /*!< Bit fields of the received frame status.
                                                                       It is useful when the Acceptance rule for
                                                                       non-matching frames is enabled by selecting
                                                                       @ref HAL_FDCAN_NO_MATCH_TO_RX_FIFO_0
                                                                       or HAL_FDCAN_NO_MATCH_TO_RX_FIFO_1             */
  } b;                                                            /*!< Bit fields of the 64-bit Rx header             */
} hal_fdcan_rx_header_t;

/**
  * @brief  HAL FDCAN Tx element header definition.
  */
typedef union
{
  uint64_t                            d64;                           /*!< 64-bit FDCAN Tx element header              */
  struct
  {
    uint32_t                          identifier               : 29; /*!< Frame identifier. A standard identifier
                                                                          is stored in bits [28:18]                   */
    hal_fdcan_frame_type_t            frame_type               : 1;  /*!< Frame type                                  */
    hal_fdcan_id_type_t               identifier_type          : 1;  /*!< Identifier type                             */
    hal_fdcan_error_state_indicator_t error_state_indicator    : 1;  /*!< Error state indicator                       */
    uint32_t                                                   : 16; /*!< Tx reserved field                           */
    hal_fdcan_data_length_code_t      data_length              : 4;  /*!< Data length code                            */
    hal_fdcan_bit_rate_switch_t       bit_rate_switch          : 1;  /*!< Bit rate switch                             */
    hal_fdcan_header_frame_format_t   frame_format             : 1;  /*!< Frame format                                */
    uint32_t                                                   : 1;  /*!< Tx reserved bit                             */
    hal_fdcan_tx_event_fifo_t         event_fifo_control       : 1;  /*!< Event FIFO control                          */
    uint32_t                          message_marker           : 8;  /*!< Message marker.
                                                                          Written by CPU during Tx buffer configuration.
                                                                          Copied into Tx event FIFO element
                                                                          for identification of Tx message status     */
  } b;                                                               /*!< Bit fields of the 64-bit Tx header          */
} hal_fdcan_tx_header_t;

/**
  * @brief  HAL FDCAN Tx Event FIFO element header definition.
  */
typedef union
{
  uint64_t                            d64;                         /*!< 64-bit FDCAN Tx Event FIFO element header     */
  struct
  {
    uint32_t                          identifier            : 29; /*!< Frame identifier, standard or extended.
                                                                       A standard identifier is stored into ID[28:18]
                                                                       field of Rx element                            */
    hal_fdcan_frame_type_t            frame_type            : 1;  /*!< Frame type                                     */
    hal_fdcan_id_type_t               identifier_type       : 1;  /*!< Identifier type                                */
    hal_fdcan_error_state_indicator_t error_state_indicator : 1;  /*!< Error state indicator                          */
    uint32_t                          tx_timestamp          : 16; /*!< Tx timestamp. The timestamp counter value is
                                                                       captured on start of frame transmission.
                                                                       Resolution depends on the configuration of the
                                                                       timestamp counter prescaler                    */
    hal_fdcan_data_length_code_t      data_length           : 4;  /*!< Data length code                               */
    hal_fdcan_bit_rate_switch_t       bit_rate_switch       : 1;  /*!< Bit rate switch                                */
    hal_fdcan_header_frame_format_t   frame_format          : 1;  /*!< Frame format                                   */
    hal_fdcan_tx_event_type_t         event_type            : 2;  /*!< Event type                                     */
    uint32_t                          message_marker        : 8;  /*!< Message marker.
                                                                       Copied from Tx event FIFO element for
                                                                       identification of Tx message status            */
  } b;                                                            /*!< Bit fields of the 64-bit Tx event FIFO header  */
} hal_fdcan_tx_evt_fifo_header_t;

/**
  * @brief  HAL FDCAN global filter parameters.
  */
typedef struct
{
  hal_fdcan_non_matching_acceptance_rules_t acceptance_non_matching_std; /*!< Acceptance rule for standard non-matching
                                                                              frames */
  hal_fdcan_non_matching_acceptance_rules_t acceptance_non_matching_ext; /*!< Acceptance rule for extended non-matching
                                                                              frames */
  hal_fdcan_remote_acceptance_frame_t       acceptance_remote_std;       /*!< Acceptance rule for standard remote
                                                                              frames */
  hal_fdcan_remote_acceptance_frame_t       acceptance_remote_ext;       /*!< Acceptance rule for extended remote
                                                                              frames */
} hal_fdcan_global_filter_config_t;

/**
  * @brief  HAL FDCAN timestamp parameters.
  */
typedef struct
{
  hal_fdcan_timestamp_source_t    timestamp_source;    /*!< Timestamp source                         */
  hal_fdcan_timestamp_prescaler_t timestamp_prescaler; /*!< Value of the timestamp prescaler counter */
} hal_fdcan_timestamp_config_t;

/**
  * @brief  HAL FDCAN timeout parameters.
  */
typedef struct
{
  hal_fdcan_timeout_operation_t timeout_operation; /*!< Timeout select                              */
  uint32_t                      timeout_period;    /*!< Value of the timeout counter (down-counter) */
} hal_fdcan_timeout_config_t;

/**
  * @brief  HAL FDCAN Tx delay compensation parameters.
  */
typedef struct
{
  uint32_t tx_delay_comp_offset;     /*!< Transmitter delay compensation offset between 0 and 0x7F               */
  uint32_t tx_delay_comp_win_length; /*!< Transmitter delay compensation filter window length between 0 and 0x7F */
} hal_fdcan_tx_delay_comp_config_t;

/**
  * @brief  HAL FDCAN filter structure definition.
  */
typedef struct
{
  hal_fdcan_id_type_t          id_type;            /*!< Specifies the identifier type.                                */
  uint32_t                     filter_index;       /*!< Specifies the filter index. The range of this parameter depends
                                                        on the filter identifier type: @ref hal_fdcan_filter_t::id_type.
                                                        - if @ref HAL_FDCAN_ID_STANDARD :
                                                          value between 0 and 27
                                                        - if @ref HAL_FDCAN_ID_EXTENDED :
                                                          value between 0 and 7 */
  hal_fdcan_filter_type_t      filter_type;        /*!< Specifies the filter type.
                                                        @ref HAL_FDCAN_FILTER_TYPE_RANGE_NO_EIDM
                                                        is permitted only when @ref hal_fdcan_filter_t::id_type is
                                                        @ref HAL_FDCAN_ID_EXTENDED                                    */
  hal_fdcan_filter_config_t    filter_config;      /*!< Specifies the filter configuration                            */
  uint32_t                     filter_id1;         /*!< Specifies the filter first identifier.
                                                        The range of this parameter depends on the configured
                                                        @ref hal_fdcan_filter_t::id_type, if:
                                                        - @ref HAL_FDCAN_ID_STANDARD : value between 0 and 0x7FF,
                                                        - @ref HAL_FDCAN_ID_EXTENDED : value between 0 and 0x1FFFFFFF */
  uint32_t                     filter_id2;         /*!< Specifies the filter second identifier.
                                                        The range of this parameter depends on the configured
                                                        @ref hal_fdcan_filter_t::id_type, if:
                                                        - @ref HAL_FDCAN_ID_STANDARD : value between 0 and 0x7FF,
                                                        - @ref HAL_FDCAN_ID_EXTENDED : value between 0 and 0x1FFFFFFF */
} hal_fdcan_filter_t;

/**
  * @brief  HAL FDCAN high priority message status structure definition.
  */
typedef struct
{
  hal_fdcan_high_prio_filter_list_t     filter_list;             /*!< Filter list of the matching filter elements     */
  uint32_t                              filter_index;            /*!< Index of matching filter element. This index only
                                                                      correspond to a previously configured filter    */
  hal_fdcan_high_prio_message_storage_t message_location_status; /*!< High priority message storage                   */
  uint32_t                              message_index;           /*!< Index of Rx FIFO element to which the message was
                                                                     stored. This parameter is valid only when
                                                                     @ref HAL_FDCAN_HP_MSG_RX_FIFO_0 or
                                                                     @ref HAL_FDCAN_HP_MSG_RX_FIFO_1
                                                                     are selected as high priority message storage    */
} hal_fdcan_high_prio_msg_status_t;

/**
  * @brief  HAL FDCAN protocol status structure definition.
  */
typedef struct
{
  hal_fdcan_protocol_error_code_t      last_error_code;      /*!< Type of the last error that occurred on the FDCAN
                                                                   bus                                                */
  hal_fdcan_protocol_error_code_t      data_last_error_code; /*!< Type of the last error that occurred in the data
                                                                  phase of a CAN FD format frame with its bitrate
                                                                  switching flag set                                  */
  hal_fdcan_communication_state_t      activity;             /*!< Communication state                                 */
  hal_fdcan_protocol_error_status_t    error_status;         /*!< Error status                                        */
  hal_fdcan_warning_status_t           error_warning;        /*!< Warning status                                      */
  hal_fdcan_bus_off_status_t           bus_off;              /*!< Bus off status                                      */
  hal_fdcan_esi_flag_status_t          rx_esi_flag;          /*!< Error state indicator flag of last received
                                                                  CAN FD message                                      */
  hal_fdcan_brs_flag_status_t          rx_brs_flag;          /*!< Switching flag of last received CAN FD message      */
  hal_fdcan_edl_flag_status_t          rx_fdf_flag;          /*!< Specifies if CAN FD message (FDF flag set) has been
                                                                  received since last protocol status                 */
  hal_fdcan_protocol_exception_event_t protocol_exception;   /*!< Protocol exception status                           */
  uint32_t                             tdc_value;            /*!< Transmitter Delay Compensation value.
                                                                  This parameter can be a number between 0 and 127    */
} hal_fdcan_protocol_status_t;

