MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.h
/**
  * @brief  HAL FDCAN error counters structure definition.
  */
typedef struct
{
  uint32_t                           tx_error_cnt;            /*!< Specifies the transmit error counter value.
                                                                   This parameter can be a number between 0 and 255   */
  uint32_t                           rx_error_cnt;            /*!< Specifies the receive error counter value.
                                                                   This parameter can be a number between 0 and 127   */
  hal_fdcan_rx_error_passive_level_t rx_error_passive_status; /*!< Specifies the receive error passive status         */
  uint32_t                           global_cnt;              /*!< Specifies the transmit/receive error logging
                                                                   counter value. This parameter can be a number
                                                                   between 0 and 255. This counter is incremented
                                                                   each time when a FDCAN protocol error causes the
                                                                   @ref hal_fdcan_error_counters_t::tx_error_cnt or the
                                                                   @ref hal_fdcan_error_counters_t::rx_error_cnt to be
                                                                   incremented.
                                                                   The counter stops at 255, the next increment of
                                                                   @ref hal_fdcan_error_counters_t::tx_error_cnt or
                                                                   @ref hal_fdcan_error_counters_t::rx_error_cnt sets
                                                                   the flag of interrupt
                                                                   @ref HAL_FDCAN_IT_ERROR_LOGGING_OVERFLOW           */
} hal_fdcan_error_counters_t;

/**
  * @brief  HAL FDCAN message RAM blocks.
  */
typedef struct
{
  uint32_t std_filter_start_addr;  /*!< Specifies the standard filter list start address */
  uint32_t ext_filter_start_addr;  /*!< Specifies the extended filter list start address */
  uint32_t rx_fifo0_start_addr;    /*!< Specifies the Rx FIFO 0 start address            */
  uint32_t rx_fifo1_start_addr;    /*!< Specifies the Rx FIFO 1 start address            */
  uint32_t tx_event_start_addr;    /*!< Specifies the Tx event FIFO start address        */
  uint32_t tx_fifo_start_addr;     /*!< Specifies the Tx FIFO/queue start address        */
} hal_fdcan_msg_ram_address_t;

/**
  * @brief  HAL FDCAN nominal bit timing structure definition.
  */
typedef struct
{
  uint32_t nominal_prescaler;  /*!< Specifies the value by which the oscillator frequency is divided for generating
                                    the nominal bit time quanta. This parameter must be a number between 1 and 512    */
  uint32_t nominal_jump_width; /*!< Specifies the maximum number of time quanta the FDCAN hardware is allowed to
                                    lengthen or shorten a bit to perform resynchronization.
                                    This parameter must be a number between 1 and 128                                 */
  uint32_t nominal_time_seg1;  /*!< Specifies the number of time quanta in bit segment 1.
                                    This parameter must be a number between 2 and 256                                 */
  uint32_t nominal_time_seg2;  /*!< Specifies the number of time quanta in bit segment 2.
                                    This parameter must be a number between 2 and 128                                 */
} hal_fdcan_nominal_bit_timing_t;

/**
  * @brief  HAL FDCAN data bit timing structure definition.
  */
typedef struct
{
  uint32_t data_prescaler;  /*!< Specifies the value by which the oscillator frequency is divided for generating
                                 the data bit time quanta. This parameter must be a number between 1 and 32           */
  uint32_t data_jump_width; /*!< Specifies the maximum number of time quanta the FDCAN hardware is allowed to
                                 lengthen or shorten a data bit to perform resynchronization.
                                 This parameter must be a number between 1 and 16                                     */
  uint32_t data_time_seg1;  /*!< Specifies the number of time quanta in data bit segment 1.
                                 This parameter must be a number between 1 and 32                                     */
  uint32_t data_time_seg2;  /*!< Specifies the number of time quanta in Data Bit Segment 2.
                                 This parameter must be a number between 1 and 16                                     */
} hal_fdcan_data_bit_timing_t;

/**
  * @brief  HAL FDCAN global configuration structure definition.
  */
typedef struct
{
  hal_fdcan_nominal_bit_timing_t        nominal_bit_timing;      /*!< Nominal bit timing                              */
  hal_fdcan_data_bit_timing_t           data_bit_timing;         /*!< Data bit Timing                                 */
  hal_fdcan_mode_t                      mode;                    /*!< Mode                                            */
  hal_fdcan_frame_format_t              frame_format;            /*!< Frame format                                    */
  hal_fdcan_auto_retransmission_state_t auto_retransmission;     /*!< Automatic retransmission feature                */
  hal_fdcan_transmit_pause_state_t      transmit_pause;          /*!< Transmit pause feature                          */
  hal_fdcan_protocol_exception_state_t  protocol_exception;      /*!< Protocol exception handling                     */
  uint32_t                              std_filters_nbr;         /*!< Number of standard message ID filters.
                                                                   This parameter must be a number between 0 and 28   */
  uint32_t                              ext_filters_nbr;         /*!< Number of extended message ID filters.
                                                                   This parameter must be a number between 0 and 8    */
  hal_fdcan_tx_mode_t                   tx_fifo_queue_mode;      /*!< Tx FIFO/queue mode selection                    */
} hal_fdcan_config_t;

typedef struct hal_fdcan_handle_s hal_fdcan_handle_t; /*!< FDCAN handle structure type */

