MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.h
#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1U)
/**
  * @brief  HAL FDCAN callback pointer definition.
  */

typedef void (*hal_fdcan_fifo_cb_t)(hal_fdcan_handle_t *hfdcan,
                                    uint32_t interrupts_list);      /*!< Pointer to interrupts list FDCAN callback
                                                                         function                                     */
typedef void (*hal_fdcan_tx_buffer_cb_t)(hal_fdcan_handle_t *hfdcan,
                                         uint32_t tx_buffers_idx);  /*!< Pointer to interrupts Tx buffer
                                                                         complete/abort FDCAN callback function       */
typedef void (*hal_fdcan_cb_t)(hal_fdcan_handle_t *hfdcan);         /*!< Pointer to a generic FDCAN callback function */

#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */

/**
  * @brief  HAL FDCAN handle structure definition.
  */
struct hal_fdcan_handle_s
{
  hal_fdcan_t                    instance;                  /*!< FDCAN instance                                  */

  hal_fdcan_msg_ram_address_t    msg_ram;                   /*!< Message RAM blocks                              */
  volatile hal_fdcan_state_t     global_state;              /*!< Communication current state                     */

#if defined(USE_HAL_FDCAN_GET_LAST_ERRORS) && (USE_HAL_FDCAN_GET_LAST_ERRORS == 1)
  volatile uint32_t              last_error_codes;          /*!< Last error codes                                */
#endif /* USE_HAL_FDCAN_GET_LAST_ERRORS */

  uint32_t                       latest_tx_fifo_q_request;  /*!< Tx buffer index of latest Tx FIFO/queue request */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  hal_os_semaphore_t             semaphore;                 /*!< FDCAN OS semaphore                              */
#endif /* USE_HAL_MUTEX */

#if defined(USE_HAL_FDCAN_USER_DATA) && (USE_HAL_FDCAN_USER_DATA == 1)
  const void                    *p_user_data;               /*!< User data pointer                               */
#endif /* USE_HAL_FDCAN_USER_DATA */

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1U)
  hal_fdcan_fifo_cb_t           p_tx_event_fifo_cb;         /*!< Tx event FIFO callback                          */
  hal_fdcan_fifo_cb_t           p_rx_fifo_0_cb;             /*!< Rx FIFO 0 callback                              */
  hal_fdcan_fifo_cb_t           p_rx_fifo_1_cb;             /*!< Rx FIFO 1 callback                              */
  hal_fdcan_cb_t                p_tx_fifo_empty_cb;         /*!< Tx FIFO empty callback                          */
  hal_fdcan_tx_buffer_cb_t      p_tx_buffer_complete_cb;    /*!< Tx buffer complete callback                     */
  hal_fdcan_tx_buffer_cb_t      p_tx_buffer_abort_cb;       /*!< Tx buffer abort callback                        */
  hal_fdcan_cb_t                p_high_priority_msg_cb;     /*!< High priority message callback                  */
  hal_fdcan_cb_t                p_ts_wraparound_cb;         /*!< Timestamp wraparound callback                   */
  hal_fdcan_cb_t                p_error_cb;                 /*!< Error callback                                  */
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */
};

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup FDCAN_Exported_Functions HAL FDCAN Functions
  * @{
  */

/** @defgroup FDCAN_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */

hal_status_t HAL_FDCAN_Init(hal_fdcan_handle_t *hfdcan, hal_fdcan_t instance);
void         HAL_FDCAN_DeInit(hal_fdcan_handle_t *hfdcan);

/**
  * @}
  */

/** @defgroup FDCAN_Exported_Functions_Group2 Power management functions
  * @{
  */

/* Power down mode */
hal_status_t HAL_FDCAN_EnterPowerDownMode(hal_fdcan_handle_t *hfdcan);
hal_status_t HAL_FDCAN_ExitPowerDownMode(hal_fdcan_handle_t *hfdcan);

/**
  * @}
  */

/** @defgroup FDCAN_Exported_Functions_Group3 Configuration functions
  * @{
  */

/* Global configuration */
hal_status_t HAL_FDCAN_SetConfig(hal_fdcan_handle_t *hfdcan, const hal_fdcan_config_t *p_config);
void         HAL_FDCAN_GetConfig(const hal_fdcan_handle_t *hfdcan, hal_fdcan_config_t *p_config);

/* Nominal bit timing */
hal_status_t HAL_FDCAN_SetNominalBitTiming(const hal_fdcan_handle_t *hfdcan,
                                           const hal_fdcan_nominal_bit_timing_t *p_nominal_bit_timing);
void         HAL_FDCAN_GetNominalBitTiming(const hal_fdcan_handle_t *hfdcan,
                                           hal_fdcan_nominal_bit_timing_t *p_nominal_bit_timing);

/* Data bit timing */
hal_status_t HAL_FDCAN_SetDataBitTiming(const hal_fdcan_handle_t *hfdcan,
                                        const hal_fdcan_data_bit_timing_t *p_data_bit_timing);
void HAL_FDCAN_GetDataBitTiming(const hal_fdcan_handle_t *hfdcan, hal_fdcan_data_bit_timing_t *p_data_bit_timing);

/* Filter - To set/get the acceptance filters parameters for standard and extended filters */
hal_status_t HAL_FDCAN_SetFilter(const hal_fdcan_handle_t *hfdcan, const hal_fdcan_filter_t *p_filter_config);
void         HAL_FDCAN_GetFilter(const hal_fdcan_handle_t *hfdcan, hal_fdcan_filter_t *p_filter_config,
                                 uint32_t filter_index, hal_fdcan_id_type_t id_type);

/* Global filter configuration */
hal_status_t HAL_FDCAN_SetGlobalFilter(const hal_fdcan_handle_t *hfdcan,
                                       const hal_fdcan_global_filter_config_t *p_global_filter_config);
void         HAL_FDCAN_GetGlobalFilter(const hal_fdcan_handle_t *hfdcan,
                                       hal_fdcan_global_filter_config_t *p_global_filter_config);

/* Extended ID mask for acceptance filtering */
hal_status_t HAL_FDCAN_SetExtendedIdMask(const hal_fdcan_handle_t *hfdcan, uint32_t mask);
uint32_t     HAL_FDCAN_GetExtendedIdMask(const hal_fdcan_handle_t *hfdcan);

/* Clock divider */
hal_status_t              HAL_FDCAN_SetClockDivider(const hal_fdcan_handle_t *hfdcan,
                                                    hal_fdcan_clock_divider_t clock_divider);
hal_fdcan_clock_divider_t HAL_FDCAN_GetClockDivider(const hal_fdcan_handle_t *hfdcan);

/* Rx FIFO overwrite */
hal_status_t HAL_FDCAN_SetRxFifoOverwrite(const hal_fdcan_handle_t *hfdcan, hal_fdcan_rx_location_t rx_location_idx,
                                          hal_fdcan_rx_fifo_mode_t operation_mode);
void         HAL_FDCAN_GetRxFifoOverwrite(const hal_fdcan_handle_t *hfdcan, hal_fdcan_rx_location_t rx_location_idx,
                                          hal_fdcan_rx_fifo_mode_t *p_operation_mode);

