MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.h
/* RAM watchdog */
hal_status_t HAL_FDCAN_SetRamWatchdog(const hal_fdcan_handle_t *hfdcan, uint8_t counter_start_value);
uint8_t      HAL_FDCAN_GetRamWatchdog(const hal_fdcan_handle_t *hfdcan);

/* Timestamp counter */
hal_status_t HAL_FDCAN_SetConfigTimestampCounter(const hal_fdcan_handle_t *hfdcan,
                                                 const hal_fdcan_timestamp_config_t *p_timestamp_config);
void         HAL_FDCAN_GetConfigTimestampCounter(const hal_fdcan_handle_t *hfdcan,
                                                 hal_fdcan_timestamp_config_t *p_timestamp_config);

/* Timeout counter */
hal_status_t HAL_FDCAN_SetConfigTimeoutCounter(const hal_fdcan_handle_t *hfdcan,
                                               const hal_fdcan_timeout_config_t *p_timeout_param);
void         HAL_FDCAN_GetConfigTimeoutCounter(const hal_fdcan_handle_t *hfdcan,
                                               hal_fdcan_timeout_config_t *p_timeout_param);
hal_status_t HAL_FDCAN_EnableTimeoutCounter(const hal_fdcan_handle_t *hfdcan);
hal_status_t HAL_FDCAN_DisableTimeoutCounter(const hal_fdcan_handle_t *hfdcan);
hal_fdcan_timeout_counter_status_t HAL_FDCAN_IsEnabledTimeoutCounter(const hal_fdcan_handle_t *hfdcan);

/* Delay compensation mechanism to compensate the CAN transmitter loop delay */
hal_status_t HAL_FDCAN_SetConfigTxDelayCompensation(const hal_fdcan_handle_t *hfdcan,
                                                    const hal_fdcan_tx_delay_comp_config_t *p_tx_delay_param);
void         HAL_FDCAN_GetConfigTxDelayCompensation(const hal_fdcan_handle_t *hfdcan,
                                                    hal_fdcan_tx_delay_comp_config_t *p_tx_delay_param);

hal_status_t                     HAL_FDCAN_EnableTxDelayCompensation(const hal_fdcan_handle_t *hfdcan);
hal_status_t                     HAL_FDCAN_DisableTxDelayCompensation(const hal_fdcan_handle_t *hfdcan);
hal_fdcan_tx_delay_comp_status_t HAL_FDCAN_IsEnabledTxDelayCompensation(const hal_fdcan_handle_t *hfdcan);

/* ISO mode - ISO11898-1 or CAN FD specification V1.0 */
hal_status_t                HAL_FDCAN_EnableISOMode(const hal_fdcan_handle_t *hfdcan);
hal_status_t                HAL_FDCAN_DisableISOMode(const hal_fdcan_handle_t *hfdcan);
hal_fdcan_iso_mode_status_t HAL_FDCAN_IsEnabledISOMode(const hal_fdcan_handle_t *hfdcan);

/* Edge filtering */
hal_status_t                      HAL_FDCAN_EnableEdgeFiltering(const hal_fdcan_handle_t *hfdcan);
hal_status_t                      HAL_FDCAN_DisableEdgeFiltering(const hal_fdcan_handle_t *hfdcan);
hal_fdcan_edge_filtering_status_t HAL_FDCAN_IsEnabledEdgeFiltering(const hal_fdcan_handle_t *hfdcan);

/* Operating mode */
hal_status_t     HAL_FDCAN_SetMode(const hal_fdcan_handle_t *hfdcan, hal_fdcan_mode_t mode);
hal_fdcan_mode_t HAL_FDCAN_GetMode(const hal_fdcan_handle_t *hfdcan);

/* Restricted operation mode */
hal_status_t                          HAL_FDCAN_EnableRestrictedOperationMode(const hal_fdcan_handle_t *hfdcan);
hal_status_t                          HAL_FDCAN_DisableRestrictedOperationMode(const hal_fdcan_handle_t *hfdcan);
hal_fdcan_restricted_op_mode_status_t HAL_FDCAN_IsEnabledRestrictedOperationMode(const hal_fdcan_handle_t *hfdcan);

/* Frame format */
hal_status_t HAL_FDCAN_SetFrameFormat(const hal_fdcan_handle_t *hfdcan, hal_fdcan_frame_format_t frame_format);
hal_fdcan_frame_format_t HAL_FDCAN_GetFrameFormat(const hal_fdcan_handle_t *hfdcan);

/* Auto retransmission of unsuccessful messages */
hal_status_t                          HAL_FDCAN_EnableAutoRetransmission(const hal_fdcan_handle_t *hfdcan);
hal_status_t                          HAL_FDCAN_DisableAutoRetransmission(const hal_fdcan_handle_t *hfdcan);
hal_fdcan_auto_retransmission_state_t HAL_FDCAN_IsEnabledAutoRetransmission(const hal_fdcan_handle_t *hfdcan);

/* Transmit pause */
hal_status_t                     HAL_FDCAN_EnableTransmitPause(const hal_fdcan_handle_t *hfdcan);
hal_status_t                     HAL_FDCAN_DisableTransmitPause(const hal_fdcan_handle_t *hfdcan);
hal_fdcan_transmit_pause_state_t HAL_FDCAN_IsEnabledTransmitPause(const hal_fdcan_handle_t *hfdcan);

/* Protocol exception */
hal_status_t                         HAL_FDCAN_EnableProtocolException(const hal_fdcan_handle_t *hfdcan);
hal_status_t                         HAL_FDCAN_DisableProtocolException(const hal_fdcan_handle_t *hfdcan);
hal_fdcan_protocol_exception_state_t HAL_FDCAN_IsEnabledProtocolException(const hal_fdcan_handle_t *hfdcan);

/* Tx mode */
hal_status_t        HAL_FDCAN_SetTxMode(const hal_fdcan_handle_t *hfdcan, hal_fdcan_tx_mode_t tx_mode);
hal_fdcan_tx_mode_t HAL_FDCAN_GetTxMode(const hal_fdcan_handle_t *hfdcan);

/* FDCAN current clock frequency */
uint32_t HAL_FDCAN_GetClockFreq(const hal_fdcan_handle_t *hfdcan);

/**
  * @}
  */

#if defined(USE_HAL_FDCAN_REGISTER_CALLBACKS) && (USE_HAL_FDCAN_REGISTER_CALLBACKS == 1U)
/** @defgroup FDCAN_Exported_Functions_Group4 Callback registration functions
  * @{
  */

/* Callbacks registration */
hal_status_t HAL_FDCAN_RegisterTxEventFifoCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_fifo_cb_t p_callback);
hal_status_t HAL_FDCAN_RegisterRxFifo0Callback(hal_fdcan_handle_t *hfdcan, hal_fdcan_fifo_cb_t p_callback);
hal_status_t HAL_FDCAN_RegisterRxFifo1Callback(hal_fdcan_handle_t *hfdcan, hal_fdcan_fifo_cb_t p_callback);
hal_status_t HAL_FDCAN_RegisterTxFifoEmptyCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_cb_t p_callback);
hal_status_t HAL_FDCAN_RegisterTxBufferCompleteCallback(hal_fdcan_handle_t *hfdcan,
                                                        hal_fdcan_tx_buffer_cb_t p_callback);
hal_status_t HAL_FDCAN_RegisterTxBufferAbortCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_tx_buffer_cb_t p_callback);
hal_status_t HAL_FDCAN_RegisterHighPriorityMessageCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_cb_t p_callback);
hal_status_t HAL_FDCAN_RegisterTimestampWraparoundCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_cb_t p_callback);
hal_status_t HAL_FDCAN_RegisterErrorCallback(hal_fdcan_handle_t *hfdcan, hal_fdcan_cb_t p_callback);

/**
  * @}
  */
#endif /* USE_HAL_FDCAN_REGISTER_CALLBACKS */

/** @defgroup FDCAN_Exported_Functions_Group5 Control functions
  * @{
  */

/* Start/Stop the FDCAN module */
hal_status_t HAL_FDCAN_Start(hal_fdcan_handle_t *hfdcan);
hal_status_t HAL_FDCAN_Stop(hal_fdcan_handle_t *hfdcan);

/* Functions involved in transmission process */
hal_status_t                   HAL_FDCAN_ReqTransmitMsgFromFIFOQ(hal_fdcan_handle_t *hfdcan,
                                                                 const hal_fdcan_tx_header_t *p_tx_element_header,
                                                                 const uint8_t *p_tx_data);
hal_fdcan_fifo_status_t        HAL_FDCAN_GetTxFifoStatus(const hal_fdcan_handle_t *hfdcan);
uint32_t                       HAL_FDCAN_GetLatestTxFifoQRequestBuffer(const hal_fdcan_handle_t *hfdcan);
hal_fdcan_tx_fifo_free_level_t HAL_FDCAN_GetTxFifoFreeLevel(const hal_fdcan_handle_t *hfdcan);
hal_status_t                   HAL_FDCAN_ReqAbortOfTxBuffer(const hal_fdcan_handle_t *hfdcan, uint32_t tx_buffer_idx);
hal_status_t                   HAL_FDCAN_GetTxEvent(const hal_fdcan_handle_t *hfdcan,
                                                    hal_fdcan_tx_evt_fifo_header_t *p_tx_event);
void                           HAL_FDCAN_GetTxEventFifoFillLevel(const hal_fdcan_handle_t *hfdcan,
                                                                 uint32_t *p_fill_level);
hal_fdcan_tx_buffer_status_t   HAL_FDCAN_GetTxBufferMessageStatus(const hal_fdcan_handle_t *hfdcan,
                                                                  uint32_t tx_buffer_idx);

