MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_fdcan.h
/* Functions involved in receiving process */
hal_status_t HAL_FDCAN_GetReceivedMessage(const hal_fdcan_handle_t *hfdcan, hal_fdcan_rx_location_t rx_location_idx,
                                          hal_fdcan_rx_header_t *p_rx_header, uint8_t *p_rx_data);
void         HAL_FDCAN_GetRxFifoFillLevel(const hal_fdcan_handle_t *hfdcan, hal_fdcan_rx_location_t rx_location_idx,
                                          uint32_t *p_fill_level);

uint16_t     HAL_FDCAN_GetTimestampCounter(const hal_fdcan_handle_t *hfdcan);
hal_status_t HAL_FDCAN_ResetTimestampCounter(const hal_fdcan_handle_t *hfdcan);

uint16_t     HAL_FDCAN_GetTimeoutCounter(const hal_fdcan_handle_t *hfdcan);
hal_status_t HAL_FDCAN_ResetTimeoutCounter(const hal_fdcan_handle_t *hfdcan);

/* Functions involved in general Tx/Rx process */
hal_status_t HAL_FDCAN_GetHighPriorityMessageStatus(const hal_fdcan_handle_t *hfdcan,
                                                    hal_fdcan_high_prio_msg_status_t *p_hp_msg_status);
hal_status_t HAL_FDCAN_GetProtocolStatus(const hal_fdcan_handle_t *hfdcan,
                                         hal_fdcan_protocol_status_t *p_protocol_status);
hal_status_t HAL_FDCAN_GetErrorCounters(const hal_fdcan_handle_t *hfdcan, hal_fdcan_error_counters_t *p_error_counters);

/* Bus off error recovery  */
hal_status_t HAL_FDCAN_Recover(const hal_fdcan_handle_t *hfdcan);

/**
  * @}
  */

/** @defgroup FDCAN_Exported_Functions_Group6 Interrupts management functions
  * @{
  */

void HAL_FDCAN_IRQHandler(hal_fdcan_handle_t *hfdcan);
void HAL_FDCAN_Line0_IRQHandler(hal_fdcan_handle_t *hfdcan);
void HAL_FDCAN_Line1_IRQHandler(hal_fdcan_handle_t *hfdcan);

hal_status_t          HAL_FDCAN_EnableInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t interrupts);
hal_status_t          HAL_FDCAN_DisableInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t interrupts);
hal_fdcan_it_status_t HAL_FDCAN_IsEnabledInterrupt(const hal_fdcan_handle_t *hfdcan, uint32_t interrupt);

hal_status_t HAL_FDCAN_EnableTxBufferCompleteInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx);
hal_status_t HAL_FDCAN_DisableTxBufferCompleteInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx);
hal_fdcan_it_tx_buffer_complete_status_t HAL_FDCAN_IsEnabledTxBufferCompleteInterrupt(const hal_fdcan_handle_t *hfdcan,
    uint32_t tx_buffer_idx);

hal_status_t HAL_FDCAN_EnableTxBufferCancellationInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx);
hal_status_t HAL_FDCAN_DisableTxBufferCancellationInterrupts(const hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx);
hal_fdcan_it_tx_buffer_abort_status_t HAL_FDCAN_IsEnabledTxBufferCancellationInterrupt(const hal_fdcan_handle_t *hfdcan,
    uint32_t tx_buffer_idx);

hal_status_t HAL_FDCAN_SetInterruptGroupsToLine(const hal_fdcan_handle_t *hfdcan, uint32_t interrupt_groups,
                                                uint32_t it_line);
uint32_t     HAL_FDCAN_GetLineFromInterruptGroup(const hal_fdcan_handle_t *hfdcan, uint32_t interrupt_group);

hal_status_t                HAL_FDCAN_EnableInterruptLines(const hal_fdcan_handle_t *hfdcan, uint32_t it_lines);
hal_status_t                HAL_FDCAN_DisableInterruptLines(const hal_fdcan_handle_t *hfdcan, uint32_t it_lines);
hal_fdcan_it_lines_status_t HAL_FDCAN_IsEnabledInterruptLine(const hal_fdcan_handle_t *hfdcan, uint32_t it_line);

/**
  * @}
  */

/** @defgroup FDCAN_Exported_Functions_Group7 Weak callback functions
  * @{
  */

void HAL_FDCAN_TxEventFifoCallback(hal_fdcan_handle_t *hfdcan, uint32_t tx_event_fifo_interrupts);
void HAL_FDCAN_RxFifo0Callback(hal_fdcan_handle_t *hfdcan, uint32_t rx_fifo0_interrupts);
void HAL_FDCAN_RxFifo1Callback(hal_fdcan_handle_t *hfdcan, uint32_t rx_fifo1_interrupts);
void HAL_FDCAN_TxFifoEmptyCallback(hal_fdcan_handle_t *hfdcan);
void HAL_FDCAN_TxBufferCompleteCallback(hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx);
void HAL_FDCAN_TxBufferAbortCallback(hal_fdcan_handle_t *hfdcan, uint32_t tx_buffers_idx);
void HAL_FDCAN_HighPriorityMessageCallback(hal_fdcan_handle_t *hfdcan);
void HAL_FDCAN_TimestampWraparoundCallback(hal_fdcan_handle_t *hfdcan);
void HAL_FDCAN_ErrorCallback(hal_fdcan_handle_t *hfdcan);

/**
  * @}
  */

/** @defgroup FDCAN_Exported_Functions_Group8 Error and state functions
  * @{
  */

hal_fdcan_state_t HAL_FDCAN_GetState(const hal_fdcan_handle_t *hfdcan);

#if defined(USE_HAL_FDCAN_GET_LAST_ERRORS) && (USE_HAL_FDCAN_GET_LAST_ERRORS == 1)
uint32_t HAL_FDCAN_GetLastErrorCodes(const hal_fdcan_handle_t *hfdcan);
#endif /* USE_HAL_FDCAN_GET_LAST_ERRORS */

/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup FDCAN_Exported_Functions_Group9 Peripheral acquire/release/free the bus
  * @{
  */

hal_status_t HAL_FDCAN_AcquireBus(hal_fdcan_handle_t *hfdcan, uint32_t timeout_ms);
hal_status_t HAL_FDCAN_ReleaseBus(hal_fdcan_handle_t *hfdcan);

/**
  * @}
  */

#endif /* USE_HAL_MUTEX */

#if defined(USE_HAL_FDCAN_USER_DATA) && (USE_HAL_FDCAN_USER_DATA == 1)
/** @defgroup FDCAN_Exported_Functions_Group10 User data Set/Get
  * @{
  */

void       HAL_FDCAN_SetUserData(hal_fdcan_handle_t *hfdcan, const void *p_user_data);
const void *HAL_FDCAN_GetUserData(const hal_fdcan_handle_t *hfdcan);

/**
  * @}
  */
#endif /* USE_HAL_FDCAN_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */

#endif /* FDCAN1 || FDCAN2 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_FDCAN_H */
